Revit 2027 API
GeomCombinationSet Class
A set that contains GeomCombination objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeomCombinationSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeomCombinationSet : APIObject,
	IEnumerable
Public Class GeomCombinationSet
	Inherits APIObject
	Implements IEnumerable
public ref class GeomCombinationSet : public APIObject,
	IEnumerable
type GeomCombinationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The GeomCombinationSet type exposes the following members.
Constructors
Name | Description
GeomCombinationSet | Initializes a new instance of the GeomCombinationSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of GeomCombinations that are in the set.
Top
Methods
Name | Description
Clear | Removes every item GeomCombination the set, rendering it empty.
Contains | Tests for the existence of an GeomCombination within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified GeomCombination from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified element into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace